Tekla Open API Reference for Tekla Structures 2025
View.ViewAttributes.Shortening Property
 Gets or sets the shortening attributes for the view.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public View.ViewShorteningAttributes Shortening { get; set; }
Public Property Shortening As View.ViewShorteningAttributes
	Get
	Set
Property Value
Type: View.ViewShorteningAttributes
See Also
Reference
View.ViewAttributes Class
Tekla.Structures.Drawing Namespace